app/views/orders/_form.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 980190962]]
---
    <div id="error_explanation">
      <h2><%=raw t('errors.template.header', count: @order.errors.count, model: t('activerecord.models.order')) %>.</h2>

SELECT "payment_types".* FROM "payment_types"
---
    <%= f.label :pay_type, t('.pay_type') %><br>
    <%= f.select :pay_type, PaymentType.names,
            prompt: t('.pay_prompt_html') %>