app/views/carts/_cart.html.erb

<% unless cart.line_items.empty? %>
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = $1 LIMIT 1  [["cart_id", 980190962]]