app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 207281424]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-11-19 11:44:26.134913"], ["updated_at", "2015-11-19 11:44:26.134913"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 207281424], ["cart_id", 980190963], ["created_at", "2015-11-19 11:44:26.146693"], ["updated_at", "2015-11-19 11:44:26.146693"]]
---
  def create
    session[:couner] = 0
    product = Product.find(params[:product_id])
    method = params[:method_id]
    if method == "true"
      @line_item = @cart.add_product(product.id)
    else
      @line_item = @cart.delete_product(product.id)
    end
    respond_to do |format|
      if @line_item.save