app/controllers/orders_controller.rb

SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = $1 LIMIT 1  [["cart_id", 980190966]]
---
  def new
  if @cart.line_items.empty?

INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-11-23 07:39:26.082013"], ["updated_at", "2015-11-23 07:39:26.082013"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "MyString"], ["address", "MyText"], ["email", "MyString"], ["pay_type", "MyString"], ["created_at", "2015-11-23 07:39:26.086896"], ["updated_at", "2015-11-23 07:39:26.086896"]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)
    @order.add_order_price(@cart,@order)
    respond_to do |format|
      if @order.save